[
    {
        "title": "Buttermilk Pancakes",
        "author": "adapted from the recipe of Alison Roman - NYT Cooking",
        "servings": "4",
        "ingredients": "2 C all-purpose flour; 3 T sugar; 1.5 t baking powder; 1.5 t baking soda; 1.25 t kosher salt; 2.5 C buttermilk; 2 large eggs; 3 T butter, melted; butter or neutral oil for pan",
        "instructions": "Whisk dry ingredients together in a medium-large bowl, then make a divot in the center for the wet ingredients.; Crack the eggs into the divot and pour the buttermilk over the eggs.; Starting with your whisk in the center, begin mixing it all together until all the ingredients are incorporated. Make sure to scrape the bottom of the bowl to get any large pockets of dry mixture, but do not overmix. Lumps are OK, smooth batter = tough pancakes. The thickness you're going for is slightly looser than regular yogurt, with some lumps in it: when you pour it on the pan, it should spread out a bit, but not run all over the place.; Heat your griddle/pan of choice over med-low heat (I use a cast-iron griddle on electric range top set at 5.5 to 6, preheated for 5 min). Coat with thin layer of butter or oil (I put a dab on, then rub it around with a towel to remove the excess).; Test the heat by ladeling a small amount of batter into the cook area of the pan. Once bubbles are rising to the surface, popping, and the hole left behind begins to linger, flip the tester. It should take around 2 minutes for the pancake to cook on one side. If it's taking an excessive amount of time, or burning, adjust the heat and try again.; After a successful tester, begin ladeling 1/3 C of batter onto the cook surface, looking for bubbles and flipping when ready. My family enjoys poking chocolate chips into the surface when they're first poured. If you push them down, the batter will rise up to cover them and prevent the chocolate burning.; Enjoy with your customary pancake topping of choice. They also save well for toastering later.; NOTE: I've made these with alt milk + vinegar before, too. They are still good, but I'd add more sugar, or sub fruit puree for eggs, or add spices as well. They are very plain when made with alt milk.",
        "isSpicy": "false",
        "hasBeef": "false",
        "hasPork": "false",
        "hasPoultry": "false",
        "hasFish": "false",
        "hasDairy": "true",
        "hasTreeNuts": "false",
        "hasPeanuts": "false",
        "hasGluten": "true",
        "hasShellfish": "false",
        "hasHoney": "false",
        "hasEggs": "true",
        "hasSoy": "false"
    },
    {
        "title": "Swedish Pancakes",
        "author": "adapted from ramshacklepantry.com",
        "servings": "2 to 4, depending how hungry they are",
        "ingredients": "4 eggs AT ROOM TEMPERATURE; 1 C milk AT ROOM TEMPERATURE; 4 T salted butter melted and COOLED TO ROOM TEMPERATURE; 1 T sugar; 0.5 t salt; 0.5 C all-purpose flour",
        "instructions": "I'm serious when I say everything should be warmed to room temperature. If something's cold, the butter is almost guaranteed to get lumpy when you're mixing the batter and your pancakes will turn out greasy and weird. If you haven't thought ahead, you can always nuke the milk in the microwave and soak the eggs in some hot water for a few minutes before you start. That usually works for me.; In a medium-sized bowl, crack the eggs, add the sugar and salt, and whisk together until the mixture is homogenized. WHile whisking, try not to encorporate too much air. Air bubbes tend to burst and leave holes in the finished pancakes while they're cooking.; Add in the milk and mix to combine.; Slowly whisk in the flour. When I'm feeling fancy, I'll sift it in. You're looking for a smooth batter here.; Once the flour is mixed in, begin whisking the mixture and slowly start streaming the melted butter in. Your goal is to encorporate it as it is entering the batter (emulsification).; Heat a 10 inch non-stick skillet over medium heat. When hot, wipe the bottom with butter or oil (careful, not too much: you don't want greasy pancakes); Ladel in 1/4 C batter, swirling it around the bottom of the pan as you pour to coat evenly.; Cook the first side for about 30 sec to 1 minute, depending on your heat. You should be seeing bubbles starting to rise up a bit in the center.; Carefully flip it over (I like to get the edge up with a spatula, then pick it up and flip it carefully with my fingers.; Cook for a few seconds on the second side, then remove to a plate. Repeat with remaining batter.; Eat with jam (lingonberry or otherwise), chocolate chips, nuttela, or lemon with powdered sugar (I also just like them plain, or as a wrap for stuff later in the day)",
        "isSpicy": "false",
        "hasBeef": "false",
        "hasPork": "false",
        "hasPoultry": "false",
        "hasFish": "false",
        "hasDairy": "true",
        "hasTreeNuts": "false",
        "hasPeanuts": "false",
        "hasGluten": "true",
        "hasShellfish": "false",
        "hasHoney": "false",
        "hasEggs": "true",
        "hasSoy": "false"
    },
    {
        "title": "Veggie Scramble",
        "author": "",
        "servings": "4 with toast and fruit, or 2 very, very hungry people",
        "ingredients": "8 eggs; 2 C of cooked veggies (recommended: bell pepper, mushrooms, summer squash, green onions cut about 1/2 inch long, greens of any kind; leftover cooked veggies of any kind); grated or crumbled cheese to taste (I prefer feta/queso fresco or a sharp cheddar); bit of butter for the pan",
        "instructions": "NOTE: Eggs love veggies, all kinds of veggies, just drain any excess moisture off the veggies before adding them into the eggs: extra liquid can cause unappealing curdling issues. If you want to use tomatoes, DO NOT COOK THEM. Add them in at the very end with the cheese. They are acidic and juicy, both of which will do things to the texture if they are cooked with the eggs.;NOTE: if you don't have any cooked veggies, 3-4 C of 1/2 to 3/4 inch diced raw veggies can be quickly sauteed before hand. Mushrooms need a bit of butter or oil to cook in, but any other veggies can be sauteed dry in a non-stick pan to avoid adding excessive moisture.;Prep veggies as needed to be added to the scramble.;Prepare cheese as desired.;Make sure anything else you'll be eating with the scramble is ready to go so you're not scrambling (haha) to try and finish it as the eggs are overcooking in their pan.;Beat eggs with salt and pepper to taste in medium bowl.;Heat 10 inch non-stick skillet with a bit of butter (about 1 t) in it over medium heat until butter is melted and beginning to talk a bit. Do not leave the area.; Pour in the eggs, begin moving them around continuously by gently and slowly scraping the bottom of the pan as the curds start to form. Turn the heat to medium low.; When the eggs are just slightly more cooked than not cooked (about half-way there), add in the veggies. Make sure to leave any accumulated liquid behind. Keep gently scraping the bottom of the pan and folding the veggies in.;When the eggs are just short of being fully cooked (still a little more wet than you would like to eat them), add about half of the cheese if using, then continue to gently scrape and fold a couple more times.;Turn off the heat and take the pan off the burner. Add the remaining cheese to the top as desired, and cover with a lid for a couple of minutes while you're getting the plates; Serve with desired accompaniments (I appreciate Cholula and toast with fruit of any kind).",
        "isSpicy": "false",
        "hasBeef": "false",
        "hasPork": "false",
        "hasPoultry": "false",
        "hasFish": "false",
        "hasDairy": "true",
        "hasTreeNuts": "false",
        "hasPeanuts": "false",
        "hasGluten": "false",
        "hasShellfish": "false",
        "hasHoney": "false",
        "hasEggs": "true",
        "hasSoy": "false"
    },
    {
        "title": "For Tommorrow: Overnight Waffles",
        "author": "adapted from Melissa Clark - NYT Cooking",
        "servings": "around 8 to 10 light, crunchy, tangy waffles. So, so good!",
        "ingredients": "2.75 C milk; 8 T unsalted butter, melted and cooled to room temperature; 1 T sugar; 1 t salt; 1.75 t instant yeast (or 2.25 t active dry yeast); 2 C all-purpose flour; 0.75 C whole wheat flour (I use white whole wheat, and you can also just use more all-purpose); 2 eggs; 0.25 t baking soda",
        "instructions": "NOTE: you can mix this and let it rise until doubled (from 1 to 3 hours depending on yeast and temp) on the counter before adding the final ingredients and cooking, but it's SO MUCH BETTER if you can let it sit in the fridge overnight!;Mix the milk, melted and cooled butter, sugar, salt, and yeast together in a medium bowl until the yeast is dissolved. NOTE: If you are using active dry yeast instead of instant, warm the milk slightly to your body temperature before mixing in the other ingredients, then let the mix sit about 5 minutes until it becomes a bit frothy. This is 'proving' the yeast: it's proving it's still alive. I prefer instant because you can skip this step and move on with your life.;Whisk in the flour(s), cover the bowl, and let rise until at least doubled in volume, or overnight in the fridge.; When you're ready to cook, whisk the eggs and baking soda into the batter while the waffle iron is heating. Grease the iron as needed, and cook about 0.5 C of batter per waffle until deep golden brown. Once they're this color, they will usually stay pretty crisp even if they have to sit a couple of minutes before being eaten.; Eat with preferred accompaniments (we're fans of peanut butter, jam, butter and syrup, occassionally chocolate chips or pan caramelized tomatoes with thyme).;Leftovers are excellent frozen to be toaster waffles later on.",
        "isSpicy": "false",
        "hasBeef": "false",
        "hasPork": "false",
        "hasPoultry": "false",
        "hasFish": "false",
        "hasDairy": "true",
        "hasTreeNuts": "false",
        "hasPeanuts": "false",
        "hasGluten": "true",
        "hasShellfish": "false",
        "hasHoney": "false",
        "hasEggs": "true",
        "hasSoy": "false"
    },
    {
        "title": "Apple Cinnamon Oatmeal",
        "author": "",
        "servings": "4 with leftovers? Easily scalable",
        "ingredients": "2 whole apples (preferrably tart) peeled and 0.5 inch diced; Ground cinnamon to taste; Lemon juice to taste; Brown sugar to tast; Pinch of salt to taste; 2 C thick rolled oats (gluten-free as needed); ~ 4 C water",
        "instructions": "Mix apple, cinnamon, brown sugar, and lemon in a medium sauce pan over medium-low heat and cook (preferrably covered) for a couple minutes until they begin to soften and release their juice; Add in the oats, water, and salt. Bring to a simmer and cook, stirring frequently, until the desired consistency is reached. It usually takes me about 10-15 minutes.;DO NOT WALK AWAY. It may be tempting, but you can SO burn oatmeal. Burnt oatmeal is gross and hard to clean up.; Once you've reached the consistency you like, taste for flavor and adjust seasonings as you like.;Serve with preferred toppings (we like milk, butter, raisins, any leftover cooked apples, a little more cinnamon and sugar, etc.); NOTE: if you're serving this to small kids, check its temp. It takes a LONG time to cool down.",
        "isSpicy": "false",
        "hasBeef": "false",
        "hasPork": "false",
        "hasPoultry": "false",
        "hasFish": "false",
        "hasDairy": "false",
        "hasTreeNuts": "false",
        "hasPeanuts": "false",
        "hasGluten": "false",
        "hasShellfish": "false",
        "hasHoney": "false",
        "hasEggs": "false",
        "hasSoy": "false"
    }
]
